In [119]:
import pandas as pd
from sqlalchemy import create_engine
import numpy as np

In [120]:
csv_file = "Resources/Fleet Data.csv"
fleet_data_df = pd.read_csv(csv_file)
fleet_data_df.head()

,Parent Airline,Airline,Aircraft Type,Current,Future,Historic,Total,Orders,Unit Cost,Total Cost (Current),Average Age
0,Aegean Airlines,Aegean Airlines,Airbus A319,1.0,NaN,3.0,4.0,NaN,$90,$90,11.6
1,Aegean Airlines,Olympic Air,Airbus A319,NaN,NaN,8.0,8.0,NaN,$90,$0,NaN
2,Aegean Airlines,Aegean Airlines,Airbus A320,38.0,NaN,3.0,41.0,NaN,$98,"$3,724",7.5
3,Aegean Airlines,Olympic Air,Airbus A320,NaN,NaN,9.0,9.0,NaN,$98,$0,NaN
4,Aegean Airlines,Aegean Airlines,Airbus A321,8.0,NaN,NaN,8.0,NaN,$115,$919,10.3

In [121]:
fleet_data_df.columns

Index(['Parent Airline', 'Airline', 'Aircraft Type', 'Current', 'Future',
       'Historic', 'Total', 'Orders', 'Unit Cost', 'Total Cost (Current)',
       'Average Age'],
      dtype='object')

In [122]:
csv_file = "Resources/Largest Airlines 2015 with Origin or Destination in USA.csv"
passenger_data_df = pd.read_csv(csv_file)
passenger_data_df.head()

,PASSENGERS,FREIGHT,MAIL,Passenger Miles,CARRIER_NAME
0,"144,637,180","289,611,118",-,"116,627,136,731",Southwest Airlines Co. Total
1,"137,916,298","975,245,401","240,169,831","186,140,690,281",Delta Air Lines Inc. Total
2,"118,541,411","987,757,310","153,541,964","166,869,071,222",American Airlines Inc. Total
3,"95,028,877","968,514,741","356,224,690","182,508,547,016",United Air Lines Inc. Total
4,"35,130,683","26,557,394",-,"41,726,258,863",JetBlue Airways Total

In [123]:
passenger_data_df.columns

Index([' PASSENGERS ', ' FREIGHT ', ' MAIL ', ' Passenger Miles ',
       'CARRIER_NAME'],
      dtype='object')

In [124]:
clean_fleet_data_df = fleet_data_df[['Parent Airline', 'Airline', 'Aircraft Type', 'Current', 'Unit Cost', 'Total Cost (Current)']].copy()
clean_fleet_data_df.head()

,Parent Airline,Airline,Aircraft Type,Current,Unit Cost,Total Cost (Current)
0,Aegean Airlines,Aegean Airlines,Airbus A319,1.0,$90,$90
1,Aegean Airlines,Olympic Air,Airbus A319,NaN,$90,$0
2,Aegean Airlines,Aegean Airlines,Airbus A320,38.0,$98,"$3,724"
3,Aegean Airlines,Olympic Air,Airbus A320,NaN,$98,$0
4,Aegean Airlines,Aegean Airlines,Airbus A321,8.0,$115,$919

In [125]:
clean_passenger_data_df = passenger_data_df[[' PASSENGERS ', ' Passenger Miles ', 'CARRIER_NAME']].copy()
clean_passenger_data_df.head()

     PASSENGERS    Passenger Miles                   CARRIER_NAME
0   144,637,180    116,627,136,731   Southwest Airlines Co. Total
1   137,916,298    186,140,690,281     Delta Air Lines Inc. Total
2   118,541,411    166,869,071,222   American Airlines Inc. Total
3    95,028,877    182,508,547,016    United Air Lines Inc. Total
4    35,130,683     41,726,258,863          JetBlue Airways Total

In [126]:
clean_passenger_data_df = clean_passenger_data_df.rename(columns={' PASSENGERS ': 'Passengers',
                                                         ' Passenger Miles ': 'Passenger Miles',
                                                         'CARRIER_NAME': 'Parent Airline'})
clean_passenger_data_df.head()

      Passengers    Passenger Miles                Parent Airline
0   144,637,180    116,627,136,731   Southwest Airlines Co. Total
1   137,916,298    186,140,690,281     Delta Air Lines Inc. Total
2   118,541,411    166,869,071,222   American Airlines Inc. Total
3    95,028,877    182,508,547,016    United Air Lines Inc. Total
4    35,130,683     41,726,258,863          JetBlue Airways Total

In [127]:
clean_passenger_data_df.dtypes

Passengers         object
Passenger Miles    object
Parent Airline     object
dtype: object

In [145]:
clean_passenger_data_df['Passengers'] = clean_passenger_data_df['Passengers'].str.strip()

In [151]:
clean_passenger_data_df.head()

    Passengers    Passenger Miles                Parent Airline
0  144,637,180   116,627,136,731   Southwest Airlines Co. Total
1  137,916,298   186,140,690,281     Delta Air Lines Inc. Total
2  118,541,411   166,869,071,222   American Airlines Inc. Total
3   95,028,877   182,508,547,016    United Air Lines Inc. Total
4   35,130,683    41,726,258,863          JetBlue Airways Total

In [154]:
clean_passenger_data_df['Passengers'] = clean_passenger_data_df['Passengers'].str.replace(',', '')
clean_passenger_data_df.head()

  Passengers    Passenger Miles                Parent Airline
0  144637180   116,627,136,731   Southwest Airlines Co. Total
1  137916298   186,140,690,281     Delta Air Lines Inc. Total
2  118541411   166,869,071,222   American Airlines Inc. Total
3   95028877   182,508,547,016    United Air Lines Inc. Total
4   35130683    41,726,258,863          JetBlue Airways Total

In [159]:
clean_passenger_data_df['Passenger Miles'] = clean_passenger_data_df['Passenger Miles'].str.replace(',', '')
clean_passenger_data_df.head()

   Passengers Passenger Miles                Parent Airline
0   144637180   116627136731   Southwest Airlines Co. Total
1   137916298   186140690281     Delta Air Lines Inc. Total
2   118541411   166869071222   American Airlines Inc. Total
3    95028877   182508547016    United Air Lines Inc. Total
4    35130683    41726258863          JetBlue Airways Total

In [160]:
clean_passenger_data_df['Passenger Miles'] = clean_passenger_data_df['Passenger Miles'].astype(str).astype(int)
clean_passenger_data_df.dtypes

Passengers          int64
Passenger Miles     int64
Parent Airline     object
dtype: object

In [163]:
clean_passenger_data_df['Passengers'].sort_values(ascending=False)
clean_passenger_data_df.head(100)

   Passengers  Passenger Miles                Parent Airline
0   144637180     116627136731  Southwest Airlines Co. Total
1   137916298     186140690281    Delta Air Lines Inc. Total
2   118541411     166869071222  American Airlines Inc. Total
3    95028877     182508547016   United Air Lines Inc. Total
4    35130683      41726258863         JetBlue Airways Total

In [134]:
# CONNECT TO LOCAL DATABASE

In [135]:
airline_connection_string = "<insert user name>:<insert password>@localhost:5432/customer_db"
engine = create_engine(f'postgresql://{rds_connection_string}')

NameError: name 'rds_connection_string' is not defined